import Container from "../components/Global/Container";
import React from "react";
import styled from "styled-components";
import HeaderTop from "../components/Global/HeaderTop";
import Footer from "../components/Layout/Footer";
import { setColor } from "../styles";

const Policy = () => {
  return (
    <>
      <HeaderTop />
      <div style={{ backgroundColor: `${setColor.containerDark}` }}>
        <Container>
          <Wrap>
            <h1 className="title">قوانین استفاده از خدمات سامانه اسنپ‌فود</h1>
            <ul>
              <li>
                اسنپ‌فود تابع قوانین و مقررات جمهوری اسلامی ایران است و درج
                هرگونه موارد سیاسی، غیر اخلاقی و مغایر با هنجارهای اجتماعی باعث
                حذف حساب کاربر مورد نظر خواهد شد.
              </li>
              <li>
                استفاده از نام و نام‌خانوادگی حقیقی افراد به منظور ثبت‌نام در
                سایت الزامی است. در صورت مشاهده کلمات رکیک و الفاظ نامناسب، حساب
                كاربر حذف خواهد شد.
              </li>
              <li>
                هنگام سفارش، ثبت یک شماره معتبر و قابل دسترس برای کاربران الزامی
                است.
              </li>
              <li>
                مسئولیت وارد کردن اطلاعات اشتباه و غیر واقعی از قبیل نام و
                نام‌خانوادگی، آدرس و شماره تماس به عهده کاربر است.
              </li>
              <li>
                در اسنپ‌فود همواره سعی کرده‌ایم، با بهترین و معتبرترین
                رستوران‌ها همکاری کنیم. ما در این زنجیره تنها نماینده‌ای برای
                برقراری ارتباط بهینه و موثر میان مشتریان و رستوران‌های سراسر
                ایران هستیم. اسنپ‌فود مسئولیتی در قبال کیفیت غذا و نحوه ارسال
                سفارش‌ها توسط رستوران‌ها عهده‌دار نیست اما همواره سعی کرده ایم
                با پیگیری و مذاکره با رستوران‌ها این مشکلات را به حداقل کاهش
                دهیم. البته در مورد سفارش‌های اکسپرس، تمام مسئولیت ارسال متوجه
                ماست و سعی در جبران هر گونه مشکل احتمالی خواهیم داشت.
              </li>
              <li>
                نشان تجاری اسنپ‌فود، در اداره کل ثبت شرکت‌ها و اداره کل مالکیت
                صنعتی به ثبت رسیده‌است و تحت پوشش قانون کپی‌رایت است.
              </li>
              <li>
                تمامی متن‌ها، طرح‌های گرافیکی و کدهای به کار گرفته شده در
                اسنپ‌فود جزو اموال شرکت «مدرن سامانه غذارسان اطلس» محسوب شده و
                هرگونه کپی برداری، نشر، نمایش، بازسازی و انتقال آن به هر صورت
                بدون اجازه مالک ممنوع بوده و پیگرد قانونی در پی خواهد داشت.
              </li>
              <li>
                جهت استفاده از تخفیف در اسنپ‌فود ( تخفیفات منو رستوران ها، کدهای
                تخفیف، بسته های خدماتی، کمپین‌ها، کوپن‌ها و هرگونه خدماتی که در
                جهت کاهش مبلغ نهایی پرداخت است) باید روش پرداخت آنلاین و یا
                اعتباری انتخاب شود و این خدمات در روش پرداخت نقدی اعمال نمی‌شود.
              </li>
            </ul>
          </Wrap>
        </Container>
      </div>
      <Footer />
    </>
  );
};

export default Policy;

const Wrap = styled.div`
 padding: 6rem 1rem;
 padding-top: 10rem;

 .title{
     font-size: 1rem;
 }

 ul {
      padding-right: 1rem;
      margin-top: 2rem;
      li {
        position: relative;
        color: ${setColor.blackLight};
        padding-bottom: .5rem;
        &::before {
          content: "";
          position: absolute;
          width: 10px;
          height: 10px;
          border-radius: 50%;
          right: -15px;
          top: 0;
          transform: translateY(50%);
          background-color: ${setColor.primaryDark};
        }
      }
`