import React from "react";
import styled from "styled-components";
import Container from "../components/Global/Container";
import HeaderTop from "../components/Global/HeaderTop";
import Footer from "../components/Layout/Footer";
import { paddingContainerWithTop, setColor } from "../styles";

const Privacy = () => {
  return (
    <>
      <HeaderTop />
      <div style={{ backgroundColor: `${setColor.containerDark}` }}>
        <Container>
          <Wrap>
            <h1 className="title">
              سیاست حفظ اطلاعات و <span>حریم خصوصی</span>
            </h1>
            <div className="desc">
              <p>
                اسنپ فود با تاکید بر احترامی که برای حریم شخصی کاربران قائل است،
                برای سفارش، ثبت نظر یا استفاده از برخی امکانات وب سایت اطلاعاتی
                را از کاربران درخواست می‌کند تا بتواند خدماتی امن و مطمئن ارائه
                دهد. برای نمونه می توان به نام، نشانی، نشانی الکترونیک (ایمیل)،
                شماره تلفن و سایر اطلاعاتی که به صورت عادی در دسترس عموم مردم
                نیست اشاره نمود. لازم به ذکر است آدرس ایمیل و تلفن‌هایی که مشتری
                در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و
                مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها
                صورت می‌گیرد.
              </p>
              <p>
                شما با ثبت نام در اسنپ فود مشخصات خود از قبیل نام و نام
                خانوادگی، تلفن تماس و … را در اختیار اسنپ فود قرار می دهید. در
                ادامه برای انجام تراکنش و ثبت سفارش نیاز به اضافه کردن مشخصات
                آدرس خود خواهید داشت. شما پس از ثبت نام در سایت، به عنوان کاربر
                اسنپ فود شناخته خواهید شد و کلیه اطلاعات مذکور و اطلاعاتی مانند
                تراکنش ها، پرداخت ها و... نیز در اختیار اسنپ فود خواهد بود.
                همچنین بدین وسیله به اطلاع کاربران رسانده میشود که اسنپ فود
                همانند سایر وب سایت‌ها از جمع آوری IP و کوکی‌ها استفاده می‌کند،
                اما پروتکل، سرور و لایه‌های امنیتی اسنپ فود و روش‌های مناسب
                مدیریت داده‌ها حداکثر تلاش را به عمل می آورد که اطلاعات کاربران
                را محافظت و از دسترسی‌های غیر قانونی جلوگیری کند. طبیعتا مسئولیت
                هرگونه سوء استفاده به شخص یا اشخاص متخلف مربوط بوده و اسنپ فود
                حق اعتراض و پیگیری را از طریق قانونی بنابر صلاحدید خود محفوظ
                میدارد
              </p>
              <p>
                برای اطلاع رسانی رویدادها و خدمات برای اعضای وب سایت ایمیل یا
                پیامک ارسال می شود. در صورتی که کاربران تمایل به دریافت اینگونه
                ایمیل ها نداشته باشند می توانند با استفاده از لینک مربوط به لغو
                اشتراک خبرنامه در انتهای ایمیل دریافتی، اقدام نمایند. شما می
                توانید کلیه اطلاعات شخصی خود را در بخش پروفایل تغییر داده و
                ویرایش کنید. این اطلاعات شامل کلیه اطلاعاتی است که شما در سایت
                اسنپ فود وارد کرده اید. اسنپ فود دسترسی کارمندان خود به اطلاعات
                کاربران را محدود نموده و هر فرد بنا به مسئولیت خود به میزان مورد
                نیاز به اطلاعات دسترسی خواهد داشت. اسنپ فود ممکن است نقد و
                نظرهای ارسالی کاربران را در راستای رعایت قوانین وب سایت ویرایش
                کند. همچنین اگر نظر یا پیام ارسال شده توسط کاربر، مشمول مصادیق
                محتوای مجرمانه باشد، اسنپ فود می‌تواند از اطلاعات ثبت شده برای
                پیگیری قانونی استفاده کند. کاربران ضمن استفاده از خدمات وبسایت،
                حق ویرایش اطلاعات و استفاده از آنها را در چارچوب فوق الذکر به
                اسنپ فود اعطاء نموده و حق اعتراض را از خود سلب مینمایند.
              </p>
              <p>
                باید تاکید شود که حفظ و نگهداری رمز عبور و نام کاربری بر عهده
                کاربران است و لذا برای جلوگیری از هرگونه سوء استفاده احتمالی،
                کاربران نباید آن اطلاعات را برای شخص دیگری فاش کنند. در صورتی که
                کاربر شماره همراه خود را به فردی دیگر واگذار کرد، جهت جلوگیری از
                سواستفاده یا مشکلات احتمالی کاربران باید شماره موبایل خود را در
                پروفایل تغییر داده و شماره جدیدی ثبت نمایند. مسئولیت هرگونه
                خسارت احتمالی که ناشی از عدم رعایت موارد فوق الذکر توسط کاربر
                باشد، با خود کاربر بوده وکاربر حق هر گونه ادعا علیه اسنپ فود را
                از خود سلب میکند. اسنپ فود هویت شخصی کاربران را محرمانه می‌داند
                و اطلاعات شخصی آنان را به هیچ شخص یا سازمان دیگری منتقل نمی‌کند،
                مگر اینکه با حکم مقام قضائی یا طبق قوانین و مقررات رایج کشور
                موظف باشد در اختیار مراجع ذی‌صلاح قرار دهد.در این موارد هیچ گونه
                مسئولیت قانونی مبنی بر جبران خسارت برای اسنپ فود وجود ندارد و
                کاربران با اعلام رضایت خود در استفاده از خدمات وب سایت ضمنا حق
                هرگونه اعتراض را از خود سلب نموده اند. اسنپ فود برای حفاظت و
                نگهداری اطلاعات و حریم شخصی کاربران همه توان خود را به کار
                می‌گیرد و امیدوار است که تجربه‌ی سفارشی امن، راحت و خوشایند را
                برای همه کاربران فراهم آورد.
              </p>
            </div>
          </Wrap>
        </Container>
      </div>
      <Footer />
    </>
  );
};

export default Privacy;

const Wrap = styled.div`
  ${paddingContainerWithTop}

  .title {
    span {
      color: ${setColor.primaryDark};
    }
    text-align: center;
  }

  .desc {
    p {
      padding-bottom: 2rem;
    }
  }
`;
